In [2]:
import pandas as pd

In [10]:
mydataset = {"key1":"value1","key2":["val2.1","val2.2"]}
print(mydataset)
df = pd.DataFrame(mydataset)
df.head()

{'key1': 'value1', 'key2': ['val2.1', 'val2.2']}

     key1    key2
0  value1  val2.1
1  value1  val2.2

In [14]:
#C:\Users\BT\Desktop\Book1.xlsx
dfx = pd.read_excel("C:\\Users\\BT\\Desktop\\Book1.xlsx")
dfx

,Lowest GPA,Seat,College Name,Result'23 (A+)
0,4.50,337,TEJGAON COLLEGE,4.0
1,4.50,326,DHAKA COMMERCE COLLEGE,352.0
2,4.00,209,WILLES LITTLE FLOWER SCHOOL & COLLEGE,NaN
3,5.00,131,MOHAMMADPUR GOVT. COLLEGE,53.0
4,4.50,111,BIAM MODEL SCHOOL & COLLEGE,9.0
5,4.50,107,MOHAMMADPUR PREPARATORY SCHOOL & COLLEGE,88.0
6,5.00,46,DHAKA CITY COLLEGE,894.0
7,4.00,37,CIVIL AVIATION SCHOOL & COLLEGE,4.0
8,4.75,29,GOVT. BANGLA COLLEGE,66.0
9,5.00,21,BIR SHRESHTHA MUNSHI ABDUR ROUF PUBLIC COLLEGE,278.0
10,4.75,14,SHAHEED RAMIZ UDDIN CANTONMENT COLLEGE,272.0
11,5.00,12,GOVT. SCIENCE COLLEGE,731.0
12,4.00,10,SHER-E-BANGLA NAGAR GOVT. BOYS' HIGH SCHOOL,NaN
13,4.50,7,GOVERNMENT LABORATORY HIGH SCHOOL,NaN
14,5.00,4,GOVT. MOHAMMADPUR MODEL SCHOOL & COLLEGE,NaN
15,5.00,2,ENGINEERING UNIVERSITY SCHOOL AND COLLEGE,NaN

In [3]:
def add(x):
    return(x+x)

add(1)

2

In [7]:
import numpy as np

In [9]:
a=np.array([1,1,1,1,1]) 
a+10

array([11, 11, 11, 11, 11])

In [10]:
A = [2,3,6,1,0]
a = set(A)
a

{0, 1, 2, 3, 6}

In [11]:
A

[2, 3, 6, 1, 0]